import { AnimatePresence, motion } from "framer-motion";

const normalActs = [
  {
    id: 1,
    docNumber: "1/2023",
    name: "Про внесення зміни до Указу Президента України від 29 січня 2020 року №28/2020",
    discription:
      "Продовжити безвізовий режим в'їзду в Україну та транзитного проїзд через територію України для громадян Сполученого Королівства Великої Британії і Північної Ірландії, якщо строк їх перебування в Україні не перевищує 90 днів протягом 180 днів, до 30 січня 2024 року.",
  },
  {
    id: 2,
    docNumber: "1/2023-рп",
    name: "Про уповноваження С.Марченка на підписання Листа про відмову до Фінансової",
    discription:
      "Продовжити безвізовий режим в'їзду в Україну та транзитного проїзд через територію України для громадян Сполученого Королівства Великої Британії і Північної Ірландії, якщо строк їх перебування в Україні не перевищує 90 днів протягом 180 днів, до 30 січня 2024 року.",
  },
  //   {
  //     id: 3,
  //     docNumber: "1/2022",
  //     name: "Про внесення зміни до Указу Президента України від 29 січня 2020 року № 28/2020",
  //     discription:
  //       "Про уповноваження С.Марченка на підписання Листа про відмову до Фінансової угоди між Україною та Європейським інвестиційним банком (Проект 'Надзвичайна кредитна програма для відновлення України').",
  //   },
];

const renderActs = normalActs.map((item) => (
  <div key={item.id} className="flex justify-start items-start gap-6 mb-4">
    <div className="w-[200px] text-sm text-red-600">{item.docNumber}</div>
    <div className="w-[600px] text-sm leading-6">{item.name}</div>
    <div className="text-sm leading-6">{item.discription}</div>
  </div>
));

function NormativeActs() {
  return (
  <>{renderActs}</>  
  );
}

export default NormativeActs;
